<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"6938f0914d86470f4750dbf24a84da180a129a19dc3ce7564a82ddf891cf7fc4","plan_job_ref":"Job Plan Airflow DAGs #176 at https://github.com/cal-itp/data-infra/actions/runs/16062597099","plan_out_hash":"3ad7689301ba733f7b31071193a8d82d5114c81f5bb35b98836d9cac189b8e0b","plan_hash":"977c2bc475a2b198627581a1dabeb7a94ba5a548071c03da5d58a37b459083e6","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "xETyWg==" -> (known after apply)
!~      detect_md5hash      = "Zj8YHXGg6ToATWmhB5GOFw==" -> "different hash"
!~      generation          = 1751416673050238 -> (known after apply)
        id                  = "calitp-composer-dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"
!~      md5hash             = "Zj8YHXGg6ToATWmhB5GOFw==" -> (known after apply)
        name                = "dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "SnqEFA==" -> (known after apply)
!~      detect_md5hash      = "+7dobyNtCU5+fcH9x/qU1Q==" -> "different hash"
!~      generation          = 1751572700554683 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "+7dobyNtCU5+fcH9x/qU1Q==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["macros/create_row_access_policy.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "3dzBQQ==" -> (known after apply)
!~      detect_md5hash      = "OnngZ3J4ZgG75SNNK24/8A==" -> "different hash"
!~      generation          = 1751416667303643 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/macros/create_row_access_policy.sql"
!~      md5hash             = "OnngZ3J4ZgG75SNNK24/8A==" -> (known after apply)
        name                = "data/warehouse/macros/create_row_access_policy.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/payments/indexes/payments_tests_daily_date_spine.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "kWcgvw==" -> (known after apply)
!~      detect_md5hash      = "tuAbU49L9JQU2UGKkY3YsQ==" -> "different hash"
!~      generation          = 1751416665446636 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/payments/indexes/payments_tests_daily_date_spine.sql"
!~      md5hash             = "tuAbU49L9JQU2UGKkY3YsQ==" -> (known after apply)
        name                = "data/warehouse/models/mart/payments/indexes/payments_tests_daily_date_spine.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "qSsiAw==" -> (known after apply)
!~      detect_md5hash      = "XEbRAfp/X/Sdqwusy59eKQ==" -> "different hash"
!~      generation          = 1751572701940534 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "XEbRAfp/X/Sdqwusy59eKQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-partial_parse will be created
+   resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = "application/vnd.msgpack"
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/target/partial_parse.msgpack"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       storage_class  = (known after apply)
    }

Plan: 1 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #176](https://github.com/cal-itp/data-infra/actions/runs/16062597099)